using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task_3
{
    class Program
    {
        /*
        На этой практике мы будем проектировать.

        Черновое проектирование (2 балла)

            Вы пишете игру со следующими возможностями:
                В игре участвуют персонажи. Каждый персонаж имеет свои значения характеристик, таких как количество хитпоинтов, скорость перемещения, время регенерации маны, и так далее
                Каждый персонаж имеет способности. Эти способности стоят некоторое количество маны
                Способности применяются на себя или на другие персонажи. Примененная способность каким-то образом изменяет характеристики персонажа.
                Применение способностей всегда оказывает временный эффект. Также способности обладают временем перезарядки.

            Создайте диаграмму классов, которая бы демонстрировала сущности персонажа, заклинаний и все остальное, что необходимо для того, чтобы:
                Определить значения характеристик персонажа с учетом всех примененных к нему способностей
                Определить доступность способностей для каждого персонажа

        Пинг-понг (выполнить 2 раза, по 1 баллу каждый)
            Придумайте фичу (способность, характеристику персонажа и т.д.), которая добавляла бы в игру минимум новых сущностей, но которую невозможно разумно реализовать в рамках текущей архитектуры.
            Расширьте архитектуру для того, чтобы эту новую фичу реализовать удалось.

        Парное выполнение
            Задание можно выполнять в парах. В этом случае черновое проектирование выполняется совместно, и баллы за него выставляются обоим студентам. Итераций пинг-понга нужно провести четыре, по две на каждого студента.
        */
        static void Main(string[] args)
        {
        }
    }
}
